Update sequence diagrams for better view
